{"/about/":{"data":{"":" ","github#Github":" Awesome resume preview view my resumeThis is a online resume generate by react and next.js. You can view it on my github repository resume repositoryThis is a online resume generate by react and next.js. You can view it on my github repository ","template#Template":" Awesome resume preview FoodFrom simple home-cooked dinners at home, to tasting new dishes while traveling — food connects us all. This category examines the world of food photography, with shots of everything from summer picnics in the park to decadent deserts. NatureNature’s wonders take center stage in this category, where photographers capture the breathtaking landscapes, diverse flora and fauna, and mesmerizing natural phenomena that adorn our planet. From grand vistas to macro shots, these images transport viewers into the heart of the great outdoors. Email Auth GitHub Auth This kind of auth requires a valid and non-temporary disposable e-mail, and a password having at least 6 characters. Do not forget to validate your email by clicking the link you will receive. The GitHub signup allows you to create an account or link your existing one to GitHub, in one click. This process asks the following permissions:\nRead your Public Key\nRead User Repositories\nThe “repository permission” is used to deploy your GitHub apps directly to Clever Cloud, with a simple step. If you need to give access to Clever Cloud’s API to a specific GitHub organization, you can do it here.\n文章的部分内容被密码保护：\n--- DON'T MODIFY THIS LINE --- You cannot see me unless you’ve got the password!This is the content you want to encrypt!\nDo remember to close the hugo-encryptor shortcodes tag:"},"title":"_index"},"/blog/":{"data":{"":" ","frameworks#Frameworks":" Step by steps guides to deploy your favorite framework on Clever Cloud DjangoConfigure your Django application to run on Clever Cloud DrupalDeploy a Drupal-based website on Clever Cloud ekg-statsdHow to configure ekg-statsd package in your Haskell application FluentdHow to deploy Fluentd using Docker on Clever Cloud LaravelDeploy a Laravel app on Clever Cloud node-statsdConfigure node-statsd package on your Node.js application to push custom metrics Play 1 x ScalaSet up your Play 1 + Scala application to run on Clever Cloud Play 2 x ScalaSet up your Play 2 + Scala application to run on Clever Cloud Ruby On RailsHow to deploy Ruby on Rails framework Ruby RackSet up a Ruby Rack application and deploy on Clever Cloud SymfonyDeploy a Symfony application on Clever Cloud WordPressDeploy WordPress on Clever Cloud MoodleFull Moodle installation and configuration guide ","level-up-your-add-ons#Level Up your Add-ons":" Take your dependencies to the next level Customize KibanaDeploy and customize a Kibana server on Clever Cloud Pgpool-IIHow to configure and use Pgpool-II for PostgreSQL add-ons ProxySQLConfigure and use ProxySQL for MySQL add-ons ","starter-tutorials#Starter Tutorials":" Tutorials to learn the basis of app configuration and deployments Node.js + MongoDB starterStarter tutorial to deploy a Node.js + MongoDB application on Clever Cloud Ruby RackWrite a hello world web application using Rack and deploy it on Clever Cloud ","static-site-generator-ssg#Static Site Generator (SSG)":"\nUse Clever Cloud as a runner to build an efficient static website and host it in minutes! AstroBuild and deploy a static Astro based website on Clever Cloud DocusaurusBuild and deploy a static Docusaurus based website on Clever Cloud Eleventy (11ty)Build and deploy a static Eleventy (11ty) based website on Clever Cloud HexoBuild and deploy a static Hexo based website on Clever Cloud HugoBuild and deploy a static Hugo based website on Clever Cloud Lume (Deno)Build and deploy a static Lume (Deno) based website on Clever Cloud MkDocsBuild and deploy a static MkDocs based website on Clever Cloud mdBookBuild and deploy a static mbBook based website on Clever Cloud NuxtBuild and deploy a static Nuxt based website on Clever Cloud "},"title":"_index"},"/blog/cgo/":{"data":{"":"CGO"},"title":"CGO"},"/docs/":{"data":{"":" Everything you need to know for your Clever Cloud journey Getting StartedGet ready to deploy and app in 5 minutes DevelopBest practices on Cloud deployments, sheduling jobs, etc. AdministrateAccess metrics, logs, manage domains, set up scalability… DeployDeploy any app on Clever Cloud. Connect an add-onConnect a managed database and set up cloud storage. Find helpLost? See how to get help. ExtendAccess Clever Cloud API, collect add-ons logs… Clever Tools CLIDeploy and manage your applications and dependencies from your terminal. ReferencesList of environment variables your can use on Clever Clever Cloud, common configuration an all instances… User AccountSet up your account, collaborate and manage permissions. BillingFind invoices, analyse consumption and understand pricing. ContributeSee how to contribute to this documentation. See our step by step tutorials Find your framework Deploy your favorite framework with our step by step guides.\nStarter tutorials Make a starter app and deploy it on Clever Cloud.\nAdd-ons guides Take your dependencies management to the next level."},"title":"_index"},"/docs/ruby/rails/":{"data":{"":" Getting StartedRuby on Rails Guides (v7.1.3) "},"title":"Rails"},"/essay/":{"data":{"":"Additions and reacord to the blog website. Feed "},"title":"Eassy"}}